Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ལེགས་རྟོགས་ལ་བུ་མོ་གཉིས་བྱུང་སྟེ། དེ་ལ་གཅིག་གི་མིང་ནི་སྒྱུ་འཕྲུལ་ཞེས་བཏགས་སོ། །གཅིག་གི་མིང་ནི་སྒྱུ་འཕྲུལ་ཆེན་མོ་ཞེས་བཏགས་ཏེ།
en: Later, King Suprabuddha had two daughters, and he named one Māyā and the other Mahā­māyā.

source: དེ་གཉིས་བྲམ་ཟེ་མཚན་མཁན་བྱེ་བྲག་ཕྱེད་པ་རྣམས་ཀྱིས་ལུང་བསྟན་པ།
en: The brahmin astrologers and augurs prophesied this about the two of them:

source: གཅིག་ལ་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བཙའ་བར་འགྱུར་རོ། །
en: “One will give birth to a universal monarch.

source: ཅིག་ཤོས་ལ་ནི་གཞོན་ནུ་མཚན་དང་ལྡན་པ་བཙའ་བར་འགྱུར་རོ། །
en: The other will give birth to a youth graced with the signs.”

source: ཞེས་ལུང་བསྟན་ཏོ། །དེ་ནས་རྒྱལ་པོ་སེང་གེ་འགྲམ་གྱིས་ཐོས་ནས་དེ་གཉིས་ཟས་གཙང་གི་བཙུན་མོར་བླངས་སོ། །
en: When King Siṃhahanu heard this, he took them both to be Śuddhodana’s queens.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་རིས་དགའ་ལྡན་གྱི་གནས་ནས་ཤི་འཕོས་ནས་ཡུམ་གྱི་ལྷུམས་སུ་ཞུགས་ཏེ།
en: One day the Bodhisattva passed away and transmigrated from the Tuṣita Heaven and entered his mother’s womb.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་སྲས་བལྟམ་སྟེ།
en: After nine or ten months had passed, she gave birth to a son.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་སློབ་ཏུ་བཅུག་ནས་དེ་ཡི་གེ་མཐར་ཕྱིན་པར་གྱུར་ཏོ། །
en: As he grew up, they made him study letters, and he mastered them.

source: བསྟན་བཅོས་ཐམས་ཅད་ཀྱང་དེས་རྟོགས་སོ། །
en: He also learned all the fields of knowledge.

source: གར་དང་གླུ་དང་རོལ་མོའི་སྒྲ་ཐམས་ཅད་ལ་ཡང་མཐར་ཕྱིན་ཏོ། །
en: He mastered as well all the performing arts of dance, singing, and music.

source: དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་གིས་བསམས་པ།
en: Then King Śuddhodana thought,

source: ད་ནི་གཞོན་ནུ་ལ་འཕོང་བསླབ་དགོས་སོ་སྙམ་ནས་
en: “Now we must train him in archery.”

source: ཤཱཀྱ་རྣམས་ལ་དྲིས་པ།
en: So he asked the Śākyas,

source: འདི་ན་འཕོང་གི་སློབ་དཔོན་གྱི་མཆོག་སུ་ཡོད་སུ་ལ་བསླབས་ན་གཞོན་ནུ་འཕོང་ལོབས་པར་འགྱུར་ཞེས་སྨྲས་སོ། །
en: “Who here is the greatest teacher of archery from whom a young person can learn archery?”

source: ཤཱཀྱ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་འཕོང་གི་སློབ་དཔོན་གཞན་ལྟ་ཞོག་སྟེ།
en: “Deva, you can forget all other teachers of archery,” the Śākyas told him.

source: རྒྱལ་པོ་ལེགས་རྟོགས་ཀྱི་བུ་ལྷར་བཅས་ཞེས་བགྱི་བ་འཕོང་གི་སློབ་དཔོན་གྱི་མཆོག་ཅིག་མཆིས་ཏེ།
en: “King Suprabuddha’s son Sahadeva is the greatest teacher of archery.

source: དེ་འདྲ་བའི་ཟླ་གཞན་མ་མཆིས་སོ། །
en: None can rival him.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་ཟས་གཙང་གིས་ལྷར་བཅས་ཕོ་ཉས་བཀུག་ནས་སྨྲས་པ།
en: As soon as he heard this, King Śuddhodana dispatched a messenger to Sahadeva, saying,

source: ལྷར་བཅས་ཁྱོད་ཀྱིས་གཞོན་ནུ་འདི་ལ་འཕོང་སློབས་ཤིག །
en: “Sahadeva, please teach this prince archery.”

source: ལྷར་བཅས་ཀྱིས་སྨྲས་པ། ཇི་ལྟར་ལྷས་དགོངས་པ་བཞིན་དུ་བགྱིའོ་ཞེས་བྱས་ནས་དེ་གཞོན་ནུ་འཕོང་སློབ་པ་ལ་ཞུགས་ཏེ
en: “As you wish, Deva,” Sahadeva replied, and he began teaching the prince archery.

source: དེས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཅི་བྱའོ་ཅོག་བསྟན་ནས་ཐམས་ཅད་ལོབས་སོ། །
en: The Bodhisattva learned everything he taught him.

source: བྱང་ཆུབ་སེམས་དཔས་ཀྱང་གང་ལ་ལྷར་བཅས་ཀྱི་ཡུལ་མ་ཡིན་པའི་ཐབས་གཞན་དག་བསྟན་ཏོ། །
en: The Bodhisattva demonstrated other techniques that were not known in Sahadeva’s country,

source: དེ་ནས་ལྷར་བཅས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་པ་དང་སྔོན་མ་བྱུང་བའི་ཐབས་རྣམས་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: and Sahadeva was amazed upon witnessing the Bodhisattva’s discipline and these techniques that he had not seen before.

source: དེས་འཕོང་གི་ཐབས་དེ་དག་གི་སློབ་མ་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལས་བསླབས་སོ། །
en: He devoted himself to studying those archery techniques and learned them himself from the Bodhisattva.

source: དེས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་རྒན་པོ་དང་ནད་པ་དང་ཤི་བ་མཐོང་ནས། ནགས་ཀྱི་ནང་དུ་གནས་བཅས་པ་དེའི་ཚེ། ལྷར་བཅས་ནི་ཡངས་པ་ཅན་དུ་སོང་ནས་
en: When the Bodhisattva witnessed old age, sickness, and death, and went to live in the forest, Sahadeva traveled to Vaiśālī.

source: དེ་ན་འདུག་པ་དང་ཡངས་པ་ཅན་གྱི་མི་རྣམས་ཀྱིས་དེ་ལ་གཞོན་ནུ་ལྔ་བརྒྱ་གཏད་དེ
en: While he was staying there, the people of Vaiśālī put five hundred youths in his care and said,

source: ཁྱོད་ཀྱིས་གཞོན་ནུ་འདི་རྣམས་གནས་ལྔ་པོ་རྣམས་སློབས་ཤིག་ཅེས་བྱས་ནས།
en: “Train these youths in the five fields of knowledge.”

source: དེས་རིང་པོ་མ་ཐོགས་པར་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་རྣམས་ལ་འཕོང་བསླབས་ཏེ། དེ་དག་གནས་ལྔའི་མཐར་ཕྱིན་པར་གྱུར་ཏོ། །
en: By the time he had completed archery training for all five hundred youths, they had mastered the five fields of knowledge.

source: དེ་ནས་དེ་དག་འདི་ལྟ་བུའི་རྒྱགས་པ་སྐྱེས་ཏེ།
en: After that they became arrogant and thought,

source: སུ་ཡང་བདག་ཅག་ལས་གཟུགས་དང་སྟོབས་དང་ཤེས་པས་མཚུངས་པ་ཡང་མེད་ན་ལྷག་པ་ལྟ་ཅི་སྨོས་སྙམ་མོ། །
en: “No one is our equal in form, strength, and knowledge—needless to speak of their being better!”

source: དེ་ནས་དེ་དག་ལ་ལྷར་བཅས་ཀྱིས་སྨྲས་པ། བུ་དག་རྒྱགས་པར་མ་བྱེད་ཅིག །
en: “Don’t be so arrogant, children,” Sahadeva said.

source: ཁྱོད་ནི་ཤཱཀྱ་དག་གི་ནང་དུ་གཞོན་ནུ་སྐྱེས་པ་དེའི་རྐང་པའི་རྡུལ་དང་ཡང་མི་མཚུངས་ན། བྱད་གཟུགས་སམ་སྟོབས་སམ་ཤེས་པས་མཉམ་པ་ལྟ་ཅི་སྨོས་ཞེས་བྱས་སོ། །
en: “You can’t equal even the dust under the feet of the prince born into the Śākya clan—needless to speak of his fine form, strength, and knowledge.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་གཞོན་ནུ་དེ་དག་ལྟ་འདོད་པར་གྱུར་ཏེ།
en: Now as soon as they heard this, the youths were eager to see him and said,

source: བདག་ཅག་དོང་ལ་གཞོན་ནུ་དེ་བལྟ་བར་བྱའོ་ཞེས་ཟེར་ཏོ། །
en: “We should go see this young man.”

source: དེ་ནས་ལྷར་བཅས་ཀྱིས་སྨྲས་པ། གཞོན་ནུ་དེས་ནི་ནགས་ཀྱི་ནང་དུ་གནས་བཅས་ཏེ། ད་ཁྱོད་ཀྱིས་དེ་མཐོང་བར་མི་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: “That young man lives in the forest,” Sahadeva told them, “so you cannot see him now.”

source: དེ་ནས་དེའི་བར་སྐབས་སུ་བཅོམ་ལྡན་འདས་གདུལ་བར་བྱ་བའི་དོན་མཛད་ཅིང་། མཐར་གྱིས་ཡངས་པ་ཅན་དུ་གཤེགས་སོ། །
en: In the meantime, while acting for the benefit of those to be tamed, the Blessed One eventually made his way to Vaiśālī.

source: དེ་ནས་ལྷར་བཅས་ཀྱིས་དེ་ཐོས་ནས་གཞོན་ནུ་དེ་དག་ལ་སྦྲན་ཏེ།
en: Sahadeva heard about this and informed the youths.

source: དེ་ཐོས་མ་ཐག་ཏུ་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་ལྟ་འདོད་ཆེས་ནས། ལྷར་བཅས་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས།
en: As soon as they heard, the five hundred youths were very eager to see the Blessed One and they went with Sahadeva to meet him.

source: གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་མཛེས་ཤིང་ཡིད་དུ་འཐད་ལ་དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ་ཐུགས་མཆོག་ཏུ་དུལ་བ་དང་རྣམ་པར་ཞི་བ་དང་ལྡན་པ་གསེར་གྱི་མཆོད་སྡོང་ལྟར་དཔལ་དང་གཟི་བརྗིད་འབར་བ་མཐོང་ངོ་། །
en: All five hundred youths saw the Blessed One, resplendent and agreeable, in the distance. His senses were tamed and his mind was perfectly tame. He was graced with tranquility, shining and magnificent like a golden pillar.

source: མཐོང་ནས་ཀྱང་དེ་དག་གི་གཟུགས་ཀྱི་རྒྱགས་པ་གང་ཡིན་པ་དེ་དག་མེད་པར་གྱུར་ཏེ།
en: When they saw him, whatever arrogance they had about their own forms disappeared.

source: དེ་རྣམས་ཀྱིས་བསམས་པ།
en: But still they thought,

source: འདི་བདག་ཅག་ལས་བྱད་གཟུགས་ཀྱིས་ནི་ཆེས་ལྷག་མོད་ཀྱི་སྟོབས་ཀྱིས་ནི་དེ་ལྟ་མ་ཡིན་ནོ་སྙམ་དུ་
en: “In form he may be our superior, but not in strength.”

source: བསམས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Thinking this, they went to see the Blessed One,

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་སྤྱན་སྔར་འཁོད་དོ། །
en: and upon their arrival they touched their heads to the Blessed One’s feet, and sat before him.

source: འདི་རྣམས་ཀྱི་ང་རྒྱལ་བཅག་དགོས་སོ་སྙམ་དུ་དགོངས་ནས།
en: “I must destroy their arrogance.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་དགོངས་པ་བསྐྱེད་དེ།
en: Then the Blessed One had a thought about the world:

source: ཀྱེ་མ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་མདའ་གཞུ་བླངས་ཏེ་ང་ལ་ལྟར་འོངས་ན་ལེགས་སོ་སྙམ་དུ་དགོངས་ནས།
en: “How good it would be for Śakra, King of the Gods, to take up his bow and arrow and come to see me!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་བསྐྱེད་པའི་མོད་ལ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་མདའ་གཞུ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་འོངས་སོ། །
en: Just as the Buddha thought this, Śakra, King of the Gods, immediately came to see the Blessed One with bow and arrow in hand.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཞོན་ནུ་དེ་དག་གི་ང་རྒྱལ་བཅག་པའི་ཕྱིར། རང་བཞིན་གྱི་སྐུ་མི་སྣང་བར་མཛད་དེ་ལྷའི་ལུས་ལྟ་བུར་སྤྲུལ་ནས།
en: Then, to shatter the youths’ arrogance, the Blessed One made his natural form disappear and emanated in the form of a deity.

source: གཞོན་ནུ་དེ་དག་དང་ཐག་མི་རིང་བ་ཞིག་ཏུ་ལྕགས་ཀྱི་ཏ་ལ་བདུན་དང་། འཁོར་ལོ་བདུན་དང་། རྔ་བོ་ཆེ་བདུན་དང་། ཕག་བདུན་སྤྲུལ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་གཞོན་ནུ་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: He then emanated seven iron palm trees, seven wheels, seven great drums, and seven bricks close to where the youths stood and addressed them, saying,

source: བུ་དག་ཁྱེད་ཀྱིས་མདའ་གཞུ་འདི་ལོང་ལ་འབེན་འདི་ལ་མདའ་འཕོངས་ཤིག་ཅེས་གསུངས་ནས་
en: “Children, take up this bow and arrow, and fire arrows into these targets.”

source: དེ་ཐོས་མ་ཐག་ཏུ་གཞོན་ནུ་དེ་དག་གིས་གཞུ་བླངས་ཏེ་བདུང་ཞེས་བྱས་ན
en: The youths hurried to take up the bow, but when he said, “Now draw,”

source: བདུང་ཡང་མ་ནུས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདེ་བླག་ཏུ་བདུངས་ཏེ།
en: they could not so much as pull the bowstring. The Blessed One, however, drew the bowstring with ease,

source: མདའ་ཡང་བླངས་ནས་མདའ་དེ་འབེན་དེ་དག་ལ་འཕངས་ཏེ། དེས་ལྕགས་ཀྱི་ཏ་ལ་བདུན་དང་། འཁོར་ལོ་བདུན་དང་། རྔ་བོ་ཆེ་བདུན་དང་། ཕག་བདུན་ལས་ཐལ་ནས་མདའ་དེ་སའི་འོག་ཏུ་སོང་ངོ་། །
en: and his arrow not only punctured the targets as it pierced the seven iron palm trees, seven wheels, seven great drums, and seven bricks, it even burrowed into the ground below.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་གཞོན་ནུ་དེ་དག་གི་སྟོབས་ཀྱིས་རྒྱགས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ཡང་མེད་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ལ་ཡང་དགའ་བར་གྱུར་ཏེ།
en: When they saw this, whatever arrogance the youths had about their own strength disappeared in an instant, and they gained admiration for the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཡིད་དགའ་བར་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their admiration and taught them the Dharma accordingly.

source: དེ་ནས་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སྟན་དེ་ཁོ་ན་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When they heard it, all five hundred youths destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས། སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After seeing the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and requested of the Blessed One,

source: དེ་ནས་དེ་དག་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་དག་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices, conferred on them full ordination, and instructed them.

source: རིག་པས་སྒོ་ངའི་སྦུབས་བཅོམ་པ་
en: Their insight crushed ignorance like an eggshell.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་
en: They achieved the insights, superknowledges, and discriminations.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་མི་ལྟ་བ་
en: They had no regard for worldly profit, passion, or acclaim.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་རྣམས་ལྷར་བཅས་ལས་བརྟེན་ཏེ། ང་རྒྱལ་བཅག་ནས་གཡུང་དྲུང་གི་མཐར་ཕྱིན་པ་དང་། གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་གཞག་པ་གཟིགས།
en: “Lord,” the monks inquired of the Blessed One, “tell us why, after all five hundred of these youths were put in the care of Sahadeva, the Blessed One shattered their arrogance and established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: འདས་པའི་དུས་ན་ཡང་འདི་རྣམས་ལྷར་བཅས་ལས་བརྟེན་ཏེ། དྲེགས་པ་བཅོམ་ནས། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “but in times past as well, and in the same way, they were put in Sahadeva’s care, and I destroyed their arrogance and placed them in the four meditative states and five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་ཙམ་པ་ཞེས་བྱ་བ་ན། རྒྱལ་པོ་གང་ཆེན་མཚོའི་ལྷ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, in times gone by, King Glacier Lake Deity reigned in the city of Campā.

source: ཕྱི་ཞིག་ན་དེའི་བཙུན་མོ་ལ་བུ་ཆགས་ནས།
en: One day his wife conceived,

source: དེ་ཟླ་བ་དགུའམ་ཟླ་བ་བཅུ་ལོན་པ་དང་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཚན་པོ་ཆེའི་སྟོབས་དང་ལྡན་པ་ཞིག་བཙས་ཏེ།
en: and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, beautiful, and endowed with tremendous strength.

source: ཁྱེའུ་འདི་གང་ཆེན་མཚོའི་ལྷའི་བུ་ཡིན་པས་ན་ཁྱེའུ་འདིའི་མིང་རྒྱ་མཚོའི་ལྷ་ཞེས་གདགས་སོ་ཞེས་ཟེར་ཏོ། །
en: ‘Since this is Glacier Lake Deity’s child, his name will be Glacier Deity.’

source: དེ་ནས་ཁྱེའུ་རྒྱ་མཚོའི་ལྷ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱིས་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ།
en: “As the young man grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as

source: གླང་པོ་ཆེ་ཞོན་པ་དང་། རྟ་ཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕོང་བ་དང་། མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་འབྱུང་བར་བྱ་བ་དང་། ལྕགས་ཀྱུ་གཟུང་བ་དང་། ཞགས་པ་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟབས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲག་པར་འཕང་བ་དང་། གནད་དུ་འཕང་བ་དང་། གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་། ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་
en: how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage.

source: བསླབས་ནས་གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ། །
en: By the time he had been educated in all of these, he was learned in the five fields of knowledge.

source: དེ་ནས་དེས་བལྟས་ན། ཕ་ཆོས་བཞིན་དང་། ཆོས་བཞིན་མ་ཡིན་པར་རྒྱལ་སྲིད་བྱེད་པ་
en: “Then he came to see that his father administrated the affairs of the kingdom both righteously and unrighteously.

source: མཐོང་ནས་ དེའི་བློ་སྐྱེས་པ།
en: Recognizing this he thought,

source: ཕ་འདས་པའི་འོག་ཏུ་བདག་གིས་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱ་དགོས་པར་འགྱུར་གྱིས།
en: ‘After the death of my father, I will have to assume the dominion of the king.

source: བདག་གིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ་ནགས་ཀྱི་ནང་དུ་གནས་བཅའ་བར་བྱའོ་
en: I will give up living at home and go live in the forest.’

source: སྙམ་དུ་བསམས་ནསཡབ་ལ་གསོལ་ཏེ་ནགས་ཀྱི་ནང་དུ་གནས་བཅས་སོ། །
en: Reflecting in this way, he asked for his father’s permission and went to live in the forest.

source: དེས་དེར་སོང་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: After he went there, he generated the four meditative states and the five superknowledges.

source: དེ་རབ་ཏུ་བྱུང་བ་དང་རྒྱལ་པོའི་བློན་པོ་ལྔ་བརྒྱའི་བུ་བཙས་ནས།
en: “After he had gone forth, the king’s ministers had five hundred sons.

source: དེ་དག་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། དེ་དག་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ་གནས་ལྔའི་བར་དུ་བྱང་བར་གྱུར་ཏོ། །
en: As they grew up, they were made to study letters and became educated in the five sciences.

source: དེ་དག་བློ་འདི་ལྟ་བུ་སྐྱེས་ཏེ་གཞན་སུ་ཡང་བྱད་གཟུགས་དང་སྟོབས་དང་ཤེས་པས་བདག་ཅག་དང་མཉམ་པ་ཡང་མེད་ན་ལྷག་པ་ལྟ་ཅི་སྨོས་སྙམ་མོ། །
en: They thought , ‘No one is our equal in form, strength, and knowledge—needless to speak of their being better!’

source: དེ་ནས་འཕོང་གི་སློབ་དཔོན་གྱིས་དེ་དག་ལ་སྨྲས་པ། བུ་དག་དེ་སྐད་མ་ཟེར་ཅིག །
en: “ ‘Children,’ their archery teacher told them, ‘don’t say such things.

source: ཁྱོད་ནི་རྒྱལ་པོ་འདི་ཉིད་ཀྱི་བུ་རབ་ནགས་ཀྱི་ནང་དུ་གནས་བཅས་པ་དེའི་བྱད་གཟུགས་དང་སྟོབས་དང་ཤེས་པའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་སྟོང་གི་ཆར་ཡང་མི་ཕོད་དོ་ཞེས་བྱས་ནས
en: Your form, strength, and knowledge aren’t even a hundredth or a thousandth of that of the prince who went to live in the great forest.’

source: དེ་ཐོས་མ་ཐག་ཏུ་གཞོན་ནུ་དེ་དག་དྲང་སྲོང་དེ་ལྟ་འདོད་པར་གྱུར་ཏེ།
en: “As soon as they heard this, the youths were eager to meet the sage,

source: འཕོང་གི་སློབ་དཔོན་དེ་ཉིད་དང་ལྷན་ཅིག་ཏུ་དྲང་སྲོང་དེ་ག་ལ་བ་དེར་དོང་ནས།
en: so they went to see him along with the archery teacher.

source: གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཐག་རིང་པོ་ཞིག་ནས་དྲང་སྲོང་མཛེས་ཤིང་ཡིད་དུ་འཐད་ལ་དབང་པོ་ཞི་ཞིང་ཡིད་ཞི་བ་དེ་མཐོང་ངོ་། །
en: All five hundred youths saw the sage in the distance and he was resplendent, agreeable, and happy. His senses were tamed, and his mind was at peace.

source: མཐོང་ནས་ཀྱང་དེ་དག་གི་གཟུགས་ཀྱི་རྒྱགས་པ་གང་ཡིན་པ་དེ་མེད་པར་གྱུར་ཏེ། དེ་དག་གིས་བསམས་པ།
en: When they saw him, whatever arrogance they had about their own forms disappeared, and they thought,

source: བདག་ཅག་གི་སློབ་དཔོན་གྱིས་འདིའི་བྱད་གཟུགས་མཛེས་པ་དང་ཡོན་ཏན་རྣམས་བསྔགས་པ་ལས། འདིའི་བྱད་གཟུགས་དེ་ཁོ་ན་བཞིན་དུ་གྱུར་པ་ལས་ན། འདིའི་ཡོན་ཏན་རྣམས་ཀྱང་དེ་ཁོ་ན་བཞིན་དུ་ཡོད་པར་ངེས་ཀྱིས།
en: ‘Since his good qualities and the splendor of his form are as great as our teacher claimed, and we ourselves are certain it is so,

source: བདག་ཅག་ཁྱིམ་ན་གནས་པ་བཏང་ལ་འདི་ཉིད་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པར་སྤྱད་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་
en: let’s give up living at home and, in his presence, practice the conduct that leads to enlightenment.’

source: དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ
en: With this thought, they went forth in his presence.

source: དེ་དག་དེར་རབ་ཏུ་བྱུང་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: Having thus gone forth, they generated the four meditative states and five superknowledges.

source: དེའི་ཚེ་དྲང་སྲོང་དུ་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was that sage then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་གཞོན་ནུ་ལྔ་བརྒྱར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་འདི་དག་ཉིད་ཡིན་ནོ། །
en: Those who were the five hundred youths then are none other than these youths.

source: དེའི་ཚེ་འཕོང་གི་སློབ་དཔོན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ལྷར་བཅས་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was their archery teacher then is none other than Sahadeva.

source: དེའི་ཚེ་ཡང་འདི་རྣམས་ལྷར་བཅས་འདི་ཁོ་ན་ལ་བརྟེན་ཏེ། ངས་དྲེགས་པ་བཅོམ་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: At that time, after they were put in Sahadeva’s care, I destroyed their arrogance and placed them in the four meditative states and five superknowledges.

source: ད་ལྟར་ཡང་འདི་རྣམས་ལྷར་བཅས་ཁོ་ན་ལས་བརྟེན་ཏེ། ངས་གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: Now as well, they have been in the sole care of Sahadeva, and I have established them in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བྱུང་སྟེ།
en: “They also went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa

source: དེར་འདི་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་
en: and practiced pure conduct all their lives.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་ཤོག་ཅིག་ཅེས་བྱས་སོ། །
en: May we go forth in his doctrine, cast away all afflictive emotions, and manifest arhatship.’

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་ལྔ་བརྒྱ་པོ་གང་ཡིན་པ་དེ་དག་ནི། ད་ལྟར་རབ་ཏུ་བྱུང་བ་འདི་དག་ཉིད་ཡིན་ཏེདེ་དག་གིས་དེར་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་གི་བར་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: The five hundred monks who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa then are now none other than these renunciants. Back then they practiced pure conduct all their lives, and at the time of their deaths, they prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པ་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་ཤོག་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: May we go forth in his doctrine, cast away all afflictive emotions, and manifest arhatship.’

source: འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: གླང་ཞེས་བྱ་བ་ནི།
en: The Bull

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་ཐག་མི་རིང་བ་ཞིག་ན། བ་ལང་གི་ཁྱུ་དག་ཅིག་འཁོད་དེ།
en: When the Blessed One was in Śrāvastī, not far from the garden of Prince Jeta there lived a certain herd of cattle.

source: དེར་གླང་ཁྱུ་མཆོག་གཉིས་འཐབས་ནས་གཅིག་གིས་གཅིག་བརྡུངས་ནས་གཅིག་གི་ལྟོ་དྲལ་ཏེ། དེའི་རྒྱུ་མ་ས་ལ་
en: There, the two bulls that led the herd were fighting and kicking one another until one of them had his stomach gored and his intestines spilled out onto the ground.

source: ལྷུང་ནས་ཟླ་དེ་ལ་སྡང་བའི་སེམས་སྐྱེས་ཏེ་ས་ལ་སྒྱེལ་ཏོ། །
en: Still feeling a surge of hatred for his opponent, he collapsed to the ground.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: གལ་ཏེ་གླང་དེ་ད་ལྟའི་སྐབས་སུ་ཤི་བར་གྱུར་ན་ནི། སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་ཏེ།
en: “If this bull dies in his present condition, he will take birth as a hell being.

source: འདི་ངན་སོང་ལས་དབྱུང་བའི་དུས་ལ་བབ་པོ་སྙམ་དུ་དགོངས་ནས།
en: The time has come to lift him out of the lower realms.”

source: བཅོམ་ལྡན་འདས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ་གླང་གི་དྲུང་དུ་གཤེགས་ནས།
en: The Blessed One disappeared from the garden of Prince Jeta and traveled to near where the bulls were.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གླང་དེའི་རྒྱུ་མ་རྣམས་ཕྱིར་ལྟོའི་ནང་དུ་བཅུག་སྟེ། རྨ་ཁ་དྲུབས་ནས་རྩྭ་དང་ཆུ་ཡང་བྱིན་ཏེ་བཀའ་སྩལ་པ།
en: He put the intestines back into the bull’s stomach, sewed the wound closed, gave him grass and water, and said to him,

source: བཞིན་བཟངས་འདི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་གོ། །
en: “And so it is, my friend: all conditioned things are impermanent.

source: ཆོས་ཐམས་ཅད་ནི་བདག་མེད་དོ། །
en: All phenomena are selfless.
